modules/LET/0.0.1/LET.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-25 Mon 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LET</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" type="text/css" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">LET</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b541d0">intro</a></li>
<li><a href="#org53a5300">specifying the syntax</a>
<ul>
<li><a href="#org867c5f4">formally</a></li>
</ul>
</li>
<li><a href="#org3e7ad69">specification of values</a>
<ul>
<li><a href="#org41adbfa">formally</a></li>
</ul>
</li>
<li><a href="#orgca209de">env</a></li>
<li><a href="#org9ab3923">exp</a></li>
<li><a href="#org4ee329f">parse</a></li>
<li><a href="#orgc911b0b">LET</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4b541d0" class="outline-2">
<h2 id="org4b541d0">intro</h2>
<div class="outline-text-2" id="text-org4b541d0">
<ul class="org-ul">
<li><p>We begin by specifying a very simple language,</p><p>which we call LET, after its most interesting feature.</p></li></ul>
</div>
</div>

<div id="outline-container-org53a5300" class="outline-2">
<h2 id="org53a5300">specifying the syntax</h2>
<div class="outline-text-2" id="text-org53a5300">
<ul class="org-ul">
<li><p>In this language,</p><p>a program is just an expression.</p><p>An expression is either</p><p></p><p><ol class="org-ol"></p><p><li>an integer constant,</li></p><p><li>a difference expression,</li></p><p><li>a zero-test expression,</li></p><p><li>a conditional expression,</li></p><p><li>a variable, or a let expression.</li></ol></p></li>

<li><p>example expression :</p><p>(diff 55 (diff x 11))</p></li></ul>
</div>

<div id="outline-container-org867c5f4" class="outline-3">
<h3 id="org867c5f4">formally</h3>
<div class="outline-text-3" id="text-org867c5f4">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> program = exp<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3e7ad69" class="outline-2">
<h2 id="org3e7ad69">specification of values</h2>
<div class="outline-text-2" id="text-org3e7ad69">
<ul class="org-ul">
<li><p>An important part of the specification</p><p>of any programming language</p><p>is the set of values that the language manipulates.</p></li>

<li><p>Each language has at least two such sets :</p><p><ol class="org-ol"></p><p><li>the expressed values</p><p>which are the possible values of expressions,</li></p><p><li>the denoted values</p><p>which are the values bound to variables.</li></ol></p></li></ul>
</div>

<div id="outline-container-org41adbfa" class="outline-3">
<h3 id="org41adbfa">formally</h3>
<div class="outline-text-3" id="text-org41adbfa">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> val = <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;bool&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> env = <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgca209de" class="outline-2">
<h2 id="orgca209de">env</h2>
<div class="outline-text-2" id="text-orgca209de">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.var</span> .val<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> env-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> val<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:env</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- env-apply fail"</span> w nl
                <span style="color: #e6db74;">"  can not find var : "</span> w <span style="color: #a6e22e;">:var</span> w nl
                <span style="color: #66d9ef; font-weight: bold;">debug</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:var</span> equal?
                   <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.val</span>
                   <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-env
  null-env
  '<span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">10</span> cons-env
  '<span style="color: #a6e22e;">:v</span> <span style="color: #ae81ff;">5</span>  cons-env
  '<span style="color: #a6e22e;">:i</span> <span style="color: #ae81ff;">1</span>  cons-env<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ab3923" class="outline-2">
<h2 id="org9ab3923">exp</h2>
<div class="outline-text-2" id="text-org9ab3923">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> .exp1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #ae81ff;">.exp1</span> <span style="color: #ae81ff;">.exp2</span> .exp3<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #ae81ff;">.exp1</span> .exp2<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   .var<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> program-eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:program</span> <span style="color: #66d9ef; font-weight: bold;">--</span> val<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:program</span> init-env eval<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> val<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.num</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> <span style="color: #ae81ff;">0</span> equal?<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
                    <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
                    <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span> sub<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:env</span> env-apply<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
                 cons-env <span style="color: #fd971f;">:new-env!</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:new-env</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ee329f" class="outline-2">
<h2 id="org4ee329f">parse</h2>
<div class="outline-text-2" id="text-org4ee329f">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #ae81ff;">123</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  <span style="color: #696969;">(</span>diff <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  <span style="color: #696969;">(</span>zero? <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  <span style="color: #a6e22e;">:var</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> int-jo?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> jo-&gt;int const-exp<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> local-jo?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> var-exp<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> cons? not<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse fail"</span> w nl
                       <span style="color: #e6db74;">"  can not parse sexp : "</span> w
                       <span style="color: #a6e22e;">:sexp</span> sexp-write nl
                       <span style="color: #66d9ef; font-weight: bold;">debug</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.car</span> <span style="color: #fd971f;">:key!</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #fd971f;">:body!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'zero? eq?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread zero?-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'if eq?<span style="color: #797979;">]</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread if-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'diff eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread diff-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'let eq?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:body</span>
                           <span style="color: #ae81ff;">.cdr</span> parse/spread let-exp<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/spread <span style="color: #B380A8;">{</span>parse<span style="color: #B380A8;">}</span> list-map list-spread<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc911b0b" class="outline-2">
<h2 id="orgc911b0b">LET</h2>
<div class="outline-text-2" id="text-orgc911b0b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> LET <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:body</span> <span style="color: #66d9ef; font-weight: bold;">--</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:body</span> <span style="color: #B380A8;">{</span>parse program-eval<span style="color: #B380A8;">}</span> list-map<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2017-09-25 Mon 19:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
